#+TITLE:Org-mode Babel test file 
#+AUTHOR: Anton Kosinov
#+email: a.s.kosinov@gmail.com
#+INFOJS_OPT: 
#+BABEL: :session *Py* :cache yes :results output graphics :exports both :tangle yes 
-----


* Initiate session
  #+BEGIN_SRC python :results output :session I
    import sys
    print(sys.version)

  #+END_SRC

  #+RESULTS:
  : 
  : >>> >>> >>> >>> 3.4.3 (default, Oct 14 2015, 20:28:29) 
  : [GCC 4.8.4]

* Test session variables
  #+BEGIN_SRC python :results output :session I
  print(sys.version)
  
  #+END_SRC

  #+RESULTS:
  : 3.4.3 (default, Oct 14 2015, 20:28:29) 
  : [GCC 4.8.4]

* Test second session
  #+BEGIN_SRC python :results output :session II
  print(sys.version)
  
  #+END_SRC

  #+RESULTS:
  : Traceback (most recent call last):
  :   File "<stdin>", line 1, in <module>
  : NameError: name 'sys' is not defined

* Test link behaviour

** Try to insert it into body
   [[http://test.org][Test]]
   It works!
